---
kind: method
id: M:Autodesk.Revit.DB.IUpdater.GetUpdaterName
source: html/b652394c-031c-6708-63e8-d93bbfb4e014.htm
---
# Autodesk.Revit.DB.IUpdater.GetUpdaterName Method

Returns a name that the Updater can be identified by to the user

## Syntax (C#)
```csharp
string GetUpdaterName()
```